//==================================================================================================================================//
//!< @file		paRootBehavior.h
//!< @brief		pa::RootBehaviorクラスのヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2018/01/31	更新履歴：
//==================================================================================================================================//

#ifndef PA_ROOT_BEHAVIOR_H
#define PA_ROOT_BEHAVIOR_H

#include "../paBehaviorBase.h"

namespace pa
{

//===================================================================================//
//!< Rootの振る舞いを行うクラス
//!< ノードの階層の一番上にくるクラス
//!< 何も行わない
//===================================================================================//
class RootBehavior : public BehaviorBase
{

public:
	/** Constructor */
	RootBehavior();

	/** Destructor */
	virtual ~RootBehavior();

	virtual bool Update(FishParam& rParam)override;

};	// class RootBehavior

}	// namespace pa

#endif	// PA_ROOT_BEHAVIOR_H
//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//

