//==================================================================================================================================//
//!< @file		Main.cpp
//!< @brief		2018年の卒展作品
//!< @author	T.Haga
//!< @data		作成日時：2017/11/02	更新履歴：
//==================================================================================================================================//

#include "sl/Library/Debugger/slDebug.h"
#include "sl/Library/EntryPoint/slEntryPoint.h"
#include "sl/library/SmartPointer/slSmartPointer.h"
#include "MainGame/paMainGame.h"

/* Entry Point ---------------------------------------------------------------------------------------- */

ENTRY_FUNCTION()
{
	sl::CheckMemoryLeak();
	sl::UniquePtr<pa::MainGame> pMainGame(new pa::MainGame());
	pMainGame->Initialize();
	pMainGame->Loop();
	return 0;
}

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
