//==================================================================================================================================//
//!< @file		paStageBackgroundManager.cpp
//!< @brief		pa::StageBackgroundManagerクラスの実装
//!< @author	T.Haga
//!< @data		作成日時：2017/12/11	更新履歴：
//==================================================================================================================================//

/* Includes --------------------------------------------------------------------------------------------------- */

#include "paStageBackgroundManager.h"

namespace pa
{

/* Public Functions ------------------------------------------------------------------------------------------- */

StageBackgroundManager::StageBackgroundManager()
{}

StageBackgroundManager::~StageBackgroundManager()
{}

void StageBackgroundManager::Initialize()
{}

void StageBackgroundManager::Update()
{}

void StageBackgroundManager::Finalize()
{}

}	// namespace pa

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
