//==================================================================================================================================//
//!< @file		paStageBackground.h
//!< @brief		pa::StageBackgroundクラスのヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/12/11	更新履歴：
//==================================================================================================================================//

#ifndef PA_STAGE_BACKGROUND_H
#define PA_STAGE_BACKGROUND_H

#include "../paStageObjBase.h"

namespace pa
{

//===================================================================================//
//!< ステージ背景クラス
//===================================================================================//
class StageBackground : public StageObjBase
{

public:
	/** Constructor */
	StageBackground();

	/** Destructor */
	~StageBackground();

	/** 更新関数 */
	virtual void Update()override;

private:


};	// class StageBackground

}	// namespace pa

#endif	// PA_STAGE_BACKGROUND_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
