//==================================================================================================================================//
//!< @file		paCommonSpeed.h
//!< @brief		速さに関する共通の宣言をまとめたヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2018/01/28	更新履歴：
//==================================================================================================================================//

#ifndef PA_COMMON_SPEED_H
#define PA_COMMON_SPEED_H

namespace pa
{

//===================================================================================//
//!< 速さの構造体
//===================================================================================//
struct Speed
{
	float		m_Left;			//!< 左方向の速さ
	float		m_Right;		//!< 右方向の速さ
	float		m_Up;			//!< 上方向の速さ
	float		m_Down;			//!< 下方向の速さ

	Speed() : m_Left(0.0f), m_Right(0.0f), m_Up(0.0f), m_Down(0.0f)
	{}

};	// struct MoveSpeed

//===================================================================================//
//!< 加速度の構造体
//===================================================================================//
struct Accelerations
{
	float		m_Left;			//!< 左方向の加速度
	float		m_Right;		//!< 右方向の加速度
	float		m_Up;			//!< 上方向の加速度
	float		m_Down;			//!< 下方向の加速度

	Accelerations() : m_Left(0.0f), m_Right(0.0f), m_Up(0.0f), m_Down(0.0f) 
	{}

	Accelerations(float left, float right, float up, float down) 
		: m_Left(left), m_Right(right), m_Up(up), m_Down(down) 
	{}

};	// struct Accelerations

}	// namespace pa

#endif	// PA_COMMON_SPEED_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
