//==================================================================================================================================//
//!< @file		paCustomizeInputEnum.h	
//!< @brief		カスタマイズインプットのenumのヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/11/22	更新履歴：
//==================================================================================================================================//

#ifndef PA_CUSTOMIZE_INPUT_ENUM_H
#define PA_CUSTOMIZE_INPUT_ENUM_H

namespace pa
{

//===================================================================================//
//!< ProjectAzurのインプットデバイスのアクションの種類
//===================================================================================//
enum CUSTOMIZE_INPUT_ACTION : int
{
	UP,						//!< 上
	DOWN,					//!< 下
	RIGHT,					//!< 右
	LEFT,					//!< 左
	DECISION_BTN,			//!< 決定ボタン
	BACK_BTN,				//!< 戻るボタン
	PAUSE_BTN,				//!< ポーズボタン
	RIGHT_MOVE,				//!< 右移動
	LEFT_MOVE,				//!< 左移動
	UP_MOVE,				//!< 上移動
	DOWN_MOVE,				//!< 下移動
	RIGHT_ROTATION,			//!< 右回転
	LEFT_ROTATION,			//!< 左回転
	SCOUTING_MODE_BTN,		//!< スカウトモードボタン
	SCOUTING_UP,			//!< 偵察モードにおける上移動
	SCOUTING_DOWN,			//!< 偵察モードにおける下移動
	SCOUTING_RIGHT,			//!< 偵察モードにおける右移動
	SCOUTING_LEFT,			//!< 偵察モードにおける左移動

#ifdef _DEBUG

#endif	// _DEBUG

};	// enum CUSTOMIZE_INPUT_ACTION

}	// namespace pa


#endif	// PA_CUSTOMIZE_INPUT_ENUM_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//


