//==================================================================================================================================//
//!< @file		paIObjectBase.h
//!< @brief		pa::IObjectBaseインターフェースのヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/11/30	更新履歴：
//==================================================================================================================================//

#ifndef PA_IOBJECT_BASE_H
#define PA_IOBJECT_BASE_H

#include "sl/Library/Utility/slDefine.h"

namespace pa
{

//===================================================================================//
//!< オブジェクトのインターフェース 
//===================================================================================//
interface IObjectBase
{

public:
	/** Constructor */
	IObjectBase() = default;

	/** Destructor */
	virtual ~IObjectBase() = default;

	/** 初期化関数 */
	virtual void Initialize() = 0;

	/** 更新関数 */
	virtual void Update() = 0;

	/** 破棄関数 */
	virtual void Finalize() = 0;

};	// class IObjectBase

}	// namespace pa

#endif	// PA_IOBJECT_BASE_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
