//==================================================================================================================================//
//!< @file		paMainGame.h	
//!< @brief		pa::MainGameクラスのヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017//11/17	更新履歴：
//==================================================================================================================================//

#ifndef PA_MAIN_GAME_H
#define PA_MAIN_GAME_H

#include "sl/Library/SmartPointer/slSmartpointer.h"
#include "sl/Library/Window/slWindow.h"

namespace pa
{

//===================================================================================//
//!< メインゲームクラス.ProjectAzur本体
//!< ゲーム起動時の初期化とゲームループを行う
//===================================================================================//
class MainGame
{

public:
	/** Constructor */
	MainGame() = default;

	/** Destructor */
	~MainGame() = default;

	/** 初期化関数 */
	bool Initialize();

	/** ループ関数 */
	void Loop();

private:
	sl::UniquePtr<sl::IWindow>		m_pWindow;		//!< sl::IWindowクラスのインスタンスへのポインタ

};	// class MainGame

}	// namespace pa

#endif // PA_MAIN_GAME_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
