//==================================================================================================================================//
//!< @file		slISceneFactory.h
//!< @brief		sl::ISceneFactoryインターフェースのヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/11/15	更新履歴：2017/11/16
//==================================================================================================================================//

#ifndef SL_ISCENE_FACTORY_H
#define SL_ISCENE_FACTORY_H

#include <string>
#include "../Utility/slDefine.h"

namespace sl
{

class SceneBase;

//===================================================================================//
//!< シーンを生成するファクトリークラスのインターフェース
//===================================================================================//
interface ISceneFactory
{

public:
	/**
	* シーンを生成する関数
	* @param[in] rSceneName		生成したいシーンの名前
	*/
	virtual SceneBase*	CreateScene(const std::string& rSceneName) = 0;

	/** Constructor*/
	ISceneFactory() = default;
	
	/** Destructor */
	~ISceneFactory() = default;

};	// interface ISceneFactory

}	//namespace sl

#endif	// SL_ISCENE_FACTORY_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
