//==================================================================================================================================//
//!< @file		slISceneDeletor.h
//!< @brief		slISceneDeletorインターフェースのへッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/11/15	更新履歴：2017/11/16
//==================================================================================================================================//

#ifndef SL_ISCENE_DELETOR_H
#define SL_ISCENE_DELETOR_H

#include "../Utility/slDefine.h"

namespace sl
{

class SceneBase;

//===================================================================================//
//!< シーンを破棄するデリータクラスのインターフェース
//===================================================================================//
interface ISceneDeletor
{

public:
	/**
	* シーンを破棄する関数
	* @param pScene 破棄したいSceneBaseクラスのインスタンスへのポインタ
	*/
	virtual void DestroyScene(SceneBase* pScene) = 0;

	/** Constructor */
	ISceneDeletor() = default;
	
	/** Destructor */
	~ISceneDeletor() = default;

};	// class ISceneDeletor

}	//namespace sl

#endif	// SL_ISCENE_DELETOR_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
