//==================================================================================================================================//
//!< @file		slSceneBase.h
//!< @brief		sl::SceneBaseクラスのヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/11/15	更新履歴：2017/11/17
//==================================================================================================================================//

#ifndef SL_SCENE_BASE_H
#define SL_SCENE_BASE_H

namespace sl
{

//===================================================================================//
//!< シーンの基底クラス 
//===================================================================================//
class SceneBase
{

public:
	/** Constructor */
	SceneBase() = default;

	/** Destructor */
	virtual ~SceneBase() = default;

	/** シーンの最初に行う処理関数 */
	virtual void Enter() = 0;

	/** シーンの実行処理関数 */
	virtual void Execute();

	/** シーンの最後に行う処理関数 */
	virtual void Exit() = 0;

protected:
	/** 制御関数 */
	virtual void Control() = 0;

	/** 描画関数 */
	virtual void Draw() = 0;

};	// class SceneBase

}	// namespace sl

#endif	// SL_SCENE_BASE_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
