//==================================================================================================================================//
//!< @file		slScene.h	
//!< @brief		SharokuLibraryのユーザー用のシーン関連をまとめたヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/11/17	更新履歴：
//==================================================================================================================================//

#ifndef SL_SCENE_H
#define SL_SCENE_H

/** シーンの基底クラスのヘッダ */
#include "slSceneBase.h"

/** シーンファクトリー（生成）インターフェースのヘッダ*/
#include "slISceneFactory.h"

/** シーンデリーター(削除) インターフェースのヘッダ*/
#include "slISceneDeletor.h"

/** シーン管理を行うクラスのヘッダ */
#include "slSceneManager.h"

#endif	// SL_SCENE_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
