//==================================================================================================================================//
//!< @file		slGraphics.h
//!< @brief		SharokuLibraryのユーザー用のグラフィックスライブラリ関連をまとめたヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/11/07	更新履歴：
//==================================================================================================================================//

#ifndef SL_GRAPHICS_H
#define SL_GRAPHICS_H

/** グラフィック関連ID */
#include "slGraphicsID.h"

/** グラフィックス関連共通宣言 */
#include "slGraphicsDeclaration.h"

/** グラフィックライブラリ */
#include "DX11GraphicsLibrary/slDX11GraphicsLibrary.h"

#endif	// SL_GRAPHICS_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
