//==================================================================================================================================//
//!< @file		slGraphicsDeclaration.h
//!< @brief		グラフィックス関連で共通で使用する宣言をまとめたヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/11/06	更新履歴：
//==================================================================================================================================//

#ifndef SL_GRAPHICS_DECLARATION_H
#define SL_GRAPHICS_DECLARATION_H

#include <vector>
#include "../Utility/slRect.h"

namespace sl
{

//===================================================================================//
//!< UVアニメーションを作成するためのデータ構造体
//===================================================================================//
struct UVAnimeCreationData
{
	int						m_AnimePatternCount;		//!< アニメーションの数
	int						m_AnimeWaitingTime;			//!< アニメーションの待機時間
	fRect					m_StartUV;					//!< スタート時点のUV値
	float					m_ScrollTu;					//!< スクロールするTu値
	float					m_ScrollTv;					//!< スクロールするTv値
	std::vector<int>		m_AnimeOrder;				//!< アニメーションの順番を格納
};	// struct UVAnimeCreationData


}	// namespace sl

#endif	// SL_GRAPHICS_DECLARATION_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
